<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"bd80991a2dcccf10f1dd2127826fb7cec169397ac0249b342800bbb193025f4a","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #557 at https://github.com/cal-itp/data-infra/actions/runs/17540451237","plan_out_hash":"840710b9002e956f91b4322919e20b3da479881027377944de2706b776f0cfd6","plan_hash":"9e3a062bacf35b312e507f7691fa09f611671fcbf798ef8411d4e960d201d141","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/external_airtable_california_transit_gtfs_datasets.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "a47r0w==" -> (known after apply)
!~      detect_md5hash      = "MfEz228QiBfYQJmOMKzAvQ==" -> "different hash"
!~      generation          = 1749661091512520 -> (known after apply)
        id                  = "calitp-staging-composer-dags/create_external_tables/airtable/external_airtable_california_transit_gtfs_datasets.yml"
!~      md5hash             = "MfEz228QiBfYQJmOMKzAvQ==" -> (known after apply)
        name                = "dags/create_external_tables/airtable/external_airtable_california_transit_gtfs_datasets.yml"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #557](https://github.com/cal-itp/data-infra/actions/runs/17540451237)